; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	image2 - mode
	thermograph0 - mode
	infrared3 - mode
	GroundStation8 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star7 - direction
	Star9 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star5)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star5)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star5)
	(supports instrument6 image1)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument7 image1)
	(supports instrument7 infrared3)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star6)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 Star9)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument11 image2)
	(calibration_target instrument11 Star5)
	(calibration_target instrument11 Star9)
	(calibration_target instrument11 Star7)
	(supports instrument12 image1)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 Star5)
	(calibration_target instrument12 Star9)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite4 Star7)
	(have_image Planet10 infrared3)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
))

)

; plan
1. (turn_to satellite4 star7 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 star7)
   goals met: 1 of 4
2. (turn_to satellite0 groundstation3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 4
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
4. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 4
5. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 4
6. (take_image satellite0 phenomenon11 instrument1 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 2 of 4
7. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 4
8. (take_image satellite0 planet10 instrument1 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 3 of 4
9. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 3 of 4
10. (take_image satellite0 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 4 of 4
